___

<a href='http://www.pieriandata.com'> <img src='../../Pierian_Data_Logo.png' /></a>
___

# SF Salaries Exercise 

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

** Import pandas as pd.**

In [1]:
import pandas as pd

** Read Salaries.csv as a dataframe called sal.**

In [2]:
sal = pd.read_csv('Salaries.csv')

** Check the head of the DataFrame. **

In [3]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [4]:

sal.set_index(['Agency', 'JobTitle', 'Id'], inplace=True)
sal.sort_index(inplace=True)

In [5]:
sal.loc[('San Francisco', 'Custodian')]

,EmployeeName,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
Id,,,,,,,,,,
55798,Jeannie Shen,54067.84,12890.29,624.00,29194.00,67582.13,96776.13,2012,NaN,NaN
56188,Vallery Williams,51502.01,0.00,13856.00,29824.20,65358.01,95182.21,2012,NaN,NaN
56412,Walfred Ferrer,51502.10,6312.70,6585.35,29703.58,64400.15,94103.73,2012,NaN,NaN
56456,Raymond J Huang,51492.80,13319.85,1012.85,28098.98,65825.50,93924.48,2012,NaN,NaN
56598,Zhen-Li Li,51502.00,10109.67,3434.62,28391.69,65046.29,93437.98,2012,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
148462,Lian Xiu Wu,177.81,0.00,14.23,1.92,192.04,193.96,2014,NaN,NaN
148580,George S Dela Pena,0.00,0.00,54.39,0.00,54.39,54.39,2014,NaN,NaN
148640,Richard A Talbert,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,NaN
148649,Leon Walker,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,NaN
148650,Roy I Tillery,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,NaN

In [6]:
sal.head()

                                       EmployeeName   BasePay  OvertimePay  \
Agency        JobTitle      Id
San Francisco ACCOUNT CLERK 20766    NAPOLEON VIRAY  60838.20         0.00
                            20868  BERNADETTE RAMOS  49777.81     10753.06
                            21639       SUSAN CHANG  51306.28      5406.34
                            22973  OLIVIA BOUDREAUX  49778.15      3811.68
                            24133        LI-XIN CAI  49777.80      1390.45

                                   OtherPay  Benefits  TotalPay  \
Agency        JobTitle      Id
San Francisco ACCOUNT CLERK 20766      0.00       NaN  60838.20
                            20868      0.00       NaN  60530.87
                            21639   1814.58       NaN  58527.20
                            22973   1084.76       NaN  54674.59
                            24133    624.00       NaN  51792.25

                                   TotalPayBenefits  Year  Notes  Status
Agency        JobTitle      Id
San Francisco ACCOUNT CLERK 20766          60838.20  2011    NaN     NaN
                            20868          60530.87  2011    NaN     NaN
                            21639          58527.20  2011    NaN     NaN
                            22973          54674.59  2011    NaN     NaN
                            24133          51792.25  2011    NaN     NaN

In [7]:
sal.xs('ACCOUNT CLERK', level='JobTitle', drop_level=False)

                                       EmployeeName   BasePay  OvertimePay  \
Agency        JobTitle      Id
San Francisco ACCOUNT CLERK 20766    NAPOLEON VIRAY  60838.20         0.00
                            20868  BERNADETTE RAMOS  49777.81     10753.06
                            21639       SUSAN CHANG  51306.28      5406.34
                            22973  OLIVIA BOUDREAUX  49778.15      3811.68
                            24133        LI-XIN CAI  49777.80      1390.45
...                                             ...       ...          ...
                            31246     ALISHA WILLIS  11247.02         0.00
                            32036    BARBARA BLOUNT   8681.58        69.82
                            34975          LIEN LUM   1630.00         0.00
                            34976        RACHEL LAU   1630.00         0.00
                            35638     TSE SHIH LENG    614.00         0.00

                                   OtherPay  Benefits  TotalPay  \
Agency        JobTitle      Id
San Francisco ACCOUNT CLERK 20766      0.00       NaN  60838.20
                            20868      0.00       NaN  60530.87
                            21639   1814.58       NaN  58527.20
                            22973   1084.76       NaN  54674.59
                            24133    624.00       NaN  51792.25
...                                     ...       ...       ...
                            31246      0.00       NaN  11247.02
                            32036      0.00       NaN   8751.40
                            34975      0.00       NaN   1630.00
                            34976      0.00       NaN   1630.00
                            35638      0.00       NaN    614.00

                                   TotalPayBenefits  Year  Notes  Status
Agency        JobTitle      Id
San Francisco ACCOUNT CLERK 20766          60838.20  2011    NaN     NaN
                            20868          60530.87  2011    NaN     NaN
                            21639          58527.20  2011    NaN     NaN
                            22973          54674.59  2011    NaN     NaN
                            24133          51792.25  2011    NaN     NaN
...                                             ...   ...    ...     ...
                            31246          11247.02  2011    NaN     NaN
                            32036           8751.40  2011    NaN     NaN
                            34975           1630.00  2011    NaN     NaN
                            34976           1630.00  2011    NaN     NaN
                            35638            614.00  2011    NaN     NaN

[83 rows x 10 columns]

In [8]:
sal[sal['EmployeeName'].str.upper() == 'JOSEPH DRISCOLL']
sal.loc[sal['EmployeeName'].str.upper() == 'JOSEPH DRISCOLL']

                                                  EmployeeName    BasePay  \
Agency        JobTitle                  Id
San Francisco CAPTAIN, FIRE SUPPRESSION 25     JOSEPH DRISCOLL  140546.86
              Captain, Fire Suppression 36199  Joseph Driscoll  145658.98

                                               OvertimePay  OtherPay  \
Agency        JobTitle                  Id
San Francisco CAPTAIN, FIRE SUPPRESSION 25        97868.77  31909.28
              Captain, Fire Suppression 36199    114513.29  28743.36

                                               Benefits   TotalPay  \
Agency        JobTitle                  Id
San Francisco CAPTAIN, FIRE SUPPRESSION 25          NaN  270324.91
              Captain, Fire Suppression 36199  42919.16  288915.63

                                               TotalPayBenefits  Year  Notes  \
Agency        JobTitle                  Id
San Francisco CAPTAIN, FIRE SUPPRESSION 25            270324.91  2011    NaN
              Captain, Fire Suppression 36199         331834.79  2012    NaN

                                               Status
Agency        JobTitle                  Id
San Francisco CAPTAIN, FIRE SUPPRESSION 25        NaN
              Captain, Fire Suppression 36199     NaN

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Use the .info() method to find out how many entries there are.**

In [4]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

**What is the average BasePay ?**

In [6]:
sal['BasePay'].mean()

66325.44884050643

66325.44884050643

** What is the highest amount of OvertimePay in the dataset ? **

In [7]:
sal['OvertimePay'].max()

245131.88

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [18]:
sal[sal['EmployeeName'].str.upper() == 'JOSEPH DRISCOLL']

                                                  EmployeeName    BasePay  \
Agency        JobTitle                  Id
San Francisco CAPTAIN, FIRE SUPPRESSION 25     JOSEPH DRISCOLL  140546.86
              Captain, Fire Suppression 36199  Joseph Driscoll  145658.98

                                               OvertimePay  OtherPay  \
Agency        JobTitle                  Id
San Francisco CAPTAIN, FIRE SUPPRESSION 25        97868.77  31909.28
              Captain, Fire Suppression 36199    114513.29  28743.36

                                               Benefits   TotalPay  \
Agency        JobTitle                  Id
San Francisco CAPTAIN, FIRE SUPPRESSION 25          NaN  270324.91
              Captain, Fire Suppression 36199  42919.16  288915.63

                                               TotalPayBenefits  Year  Notes  \
Agency        JobTitle                  Id
San Francisco CAPTAIN, FIRE SUPPRESSION 25            270324.91  2011    NaN
              Captain, Fire Suppression 36199         331834.79  2012    NaN

                                               Status
Agency        JobTitle                  Id
San Francisco CAPTAIN, FIRE SUPPRESSION 25        NaN
              Captain, Fire Suppression 36199     NaN

** How much does JOSEPH DRISCOLL make (including benefits)? **

24    270324.91
Name: TotalPayBenefits, dtype: float64

** What is the name of highest paid person (including benefits)?**

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

** How many unique job titles are there? **

2159

** What are the top 5 most common jobs? **

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

202

** How many people have the word Chief in their job title? (This is pretty tricky) **

477

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

# Great Job!